app/Http/Controllers/AccountSaveController.php

            }
        }

        $user = User::where('id','LIKE',auth()->id())->update([

            'name' => $validate['name'],
            'email' => $validate['email'],
        ]);
---
UPDATE `users` SET `name` = 'Charma1ine W McMartin', `email` = 'mahmoudganas@gmail.com', `users`.`updated_at` = '2022-09-09 19:11:50' WHERE `id` LIKE 8