app/Http/Controllers/HomeController.php

    public function index()
    {
        if(Session::has('lang')){

            app()->setLocale(Session::get('lang'));
            $user = User::find(auth()->id());
            $userp = $user->product;
            return view('Dashboard.index',
        [

            'user' => $user,
            'product' => $userp

        ]);
        }

        $user = User::find(auth()->id());
---
SELECT * FROM `users` WHERE `users`.`id` = 8 LIMIT 1
SELECT `products`.*, `userps`.`user_id` as `pivot_user_id`, `userps`.`product_id` as `pivot_product_id` FROM `products` inner join `userps` on `products`.`id` = `userps`.`product_id` WHERE `userps`.`user_id` = 5
SELECT * FROM `users` WHERE `users`.`id` = 5 LIMIT 1