app/Http/Controllers/PagesController.php

    public function index(){
        // Role::create(['name' => 'User']);

        if(Session::has('lang')){

            app()->setLocale(Session::get('lang'));

        }
        // dd(Category::first()->product());

        return view('index',
        [

            'desc' => desc::first(),
            'data' => pages::all(),
            'devices' => boxes::all(),
            'categories' => Category::all(),
            'customers' => Customers::all()
        ]
    );
---
SELECT * FROM `customers`
SELECT * FROM `descs` LIMIT 1
SELECT * FROM `categories`