app/Http/Controllers/Search.php

SELECT * FROM `categories`
---
    public function index()
    {
        if(Session::has('lang')){

            app()->setLocale(Session::get('lang'));
            return view('Search',[

                'categories' => Category::all()