app/Http/Controllers/Admin/AdminEditProduct.php

    public function index($id){


        return view('Admin.Dashboard.EditProduct',[

            'pages' => AdminPages::all(),
            'product' => Product::find($id),
            'categories' => Category::all()
---
SELECT * FROM `admin_pages`
SELECT * FROM `products` WHERE `products`.`id` = '1' LIMIT 1
SELECT * FROM `categories`

    public function edit(){



            $validate = request()->validate([

                'id' => 'required',
                'name' => 'required',
                'category_id' => 'required',
                'price' => 'required',
                'img' => 'image'

            ]);
            $product = Product::find($validate['id']);

        if(isset($validate['img'])){
            $all = [
                'en' => $validate['name'],
                'ar' => request('name_arabic')
            ];

            // dd($all);
            $replace = $product->replaceTranslations('name',$all)->save();
            $base = base64_encode($validate['img'] = request()->file('img')->get());
            $image = ImageApiController::api($base);
            $validate['img'] = $image->image->url;
            $product->update($validate);
---
SELECT * FROM `products` WHERE `products`.`id` = '67' LIMIT 1
UPDATE `products` SET `name` = '{\"en\":\"test\",\"ar\":\"test\"}', `products`.`updated_at` = '2022-09-10 01:42:38' WHERE `id` = 67
UPDATE `products` SET `img` = 'https://iili.io/PFqoKl.jpg', `products`.`updated_at` = '2022-09-10 01:42:40' WHERE `id` = 67