app/Http/Controllers/Admin/AdminHomeController.php

SELECT * FROM `users` WHERE `users`.`id` = 11 LIMIT 1
SELECT * FROM `products`
SELECT * FROM `admin_pages`
---
    public function Adminindex()
    {

        return view('Admin.Dashboard.index',
    [

        'user' => User::find(auth()->id()),
        'product' => Product::all(),
        'pages' => AdminPages::all()