app/Http/Controllers/Admin/CategoriesController.php

SELECT * FROM `admin_pages`
SELECT * FROM `categories`
---
    public function index()
    {


        return view('Admin.Dashboard.Categories', [

            'user' => auth()->user(),
            'pages' => AdminPages::all(),
            'Categories' => Category::all()

SELECT * FROM `admin_pages`
---
    public function add(){

        return view('Admin.Dashboard.AddCategory',[

            'pages' => AdminPages::all()