app/Http/Controllers/Admin/EditPageController.php

    public function index(pages $id){


        return view('Admin.Dashboard.EditPage',[
            'pages' => AdminPages::all(),
            'page' => $id
        ]);
---
SELECT * FROM `admin_pages`