app/Http/Controllers/Admin/UsersController.php

    public function index(){

        return view('Admin.Dashboard.Users',[

            'pages' => AdminPages::all(),
            'users' => User::all()
---
SELECT * FROM `admin_pages`
SELECT * FROM `users`