app/Http/Controllers/Admin/UserEditController.php

SELECT * FROM `admin_pages`
---
    public function index(User $id){
        return view('Admin.Dashboard.EditUser',[

            'pages' => AdminPages::all(),

SELECT * FROM `users` WHERE `users`.`id` = '5' LIMIT 1
---
    public function edit(){


        try{
            $validate = request()->validate([

                'name' => 'required',
                'email' => 'required',
                'password' => 'nullable',
                'img' => 'nullable',

            ]);

        $user = User::find(request('id'));

DELETE FROM `model_has_roles` WHERE `model_id` = 5
---
                'name' => $validate['name'],
                'email' => $validate['email'],
            ]);
            DB::table('model_has_roles')->where('model_id',$user->id)->delete();